
$(function(){
	
	
// banner 轮播图效果
(function(){
	
	var a = 15;
	
	轮播图效果
	
	
})();// 函数立即执行表达式  可以实现一个简单的模块化 

// 放大镜效果

(function(){
	var a = 25;
	放大镜效果
	
})();
	
// tab选项卡
(function(){
	
	当前页面有三个地方都有选项卡效果  但是有一些小差别    有些鼠标移上    鼠标单击   有些三个选项卡   有些四个选项卡   传参
	
	封装一个核心功能  通过传参  实现多次调用 代码复用
	
	
	
})();
	
	
	
	
	
	
})

页面  html+css   (整体  ==>局部    大==>小  结构稳固  )

低保真原型  ==中保真   ==> 高保真 (最后效果)
大的结构 大的模块 布局    ==> 小结构 布局   ==> 填充细化

js  (html+css) +js  pc网站                              (网站cookie ajax)


推荐js   jq




